{
  "backend/main.mo": "Empty Motoko actor placeholder with no functionality.",
  "feature_evidence.json": "Feature evidence report listing UI animation features tied to specific frontend files and components.",
  "frontend-file-summaries.txt": "Text file containing high-level summaries for all major frontend source files and assets.",
  "frontend/index.css": "Tailwind base config and OKLCH color variables for light/dark modes with global background and text styling.",
  "frontend/index.html": "Basic HTML shell loading the React app root and main entry script.",
  "frontend/src/App.tsx": "Main React component controlling view state, evasive button logic, heart bursts, and accepted-view animations.",
  "frontend/src/components/CelebrationHearts.tsx": "Generates and animates floating heart particles continuously across the screen.",
  "frontend/src/components/HeartBurst.tsx": "Renders a radial burst of animated hearts at a given click position.",
  "frontend/src/components/RedRoseBouquet3D.tsx": "3D bouquet component using React Three Fiber with animated roses and fallback behavior.",
  "frontend/src/components/ValentineLayout.tsx": "Centered layout wrapper providing a styled card container for all views.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor via Internet Identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity login state, loading stored identities, and exposing login/clear functions.",
  "frontend/src/index.css": "Defines Tailwind layers, color variables, dark mode styles, and custom animations including bouquet fade-in and glow effects.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the Internet Identity provider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, fonts, and plugins.",
  "project_state.json": "Describes project state and features for adding a 1s bouquet fade-in and pulsing glow on the Yes page."
}